NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/ra_gen/hal_data.c
/* generated HAL source file - do not edit */
#include "hal_data.h"

/* Macros to tie dynamic ELC links to adc_b_trigger_sync_elc option in adc_b_trigger_t. */
#define ADC_B_TRIGGER_ADC_B0        ADC_B_TRIGGER_SYNC_ELC
#define ADC_B_TRIGGER_ADC_B0_B      ADC_B_TRIGGER_SYNC_ELC
#define ADC_B_TRIGGER_ADC_B1        ADC_B_TRIGGER_SYNC_ELC
#define ADC_B_TRIGGER_ADC_B1_B      ADC_B_TRIGGER_SYNC_ELC
agt_instance_ctrl_t g_agt1_ctrl;
const agt_extended_cfg_t g_agt1_extend = { .count_source = AGT_CLOCK_PCLKB,
		.agto = AGT_PIN_CFG_DISABLED, .agtoab_settings_b.agtoa =
				AGT_PIN_CFG_DISABLED, .agtoab_settings_b.agtob =
				AGT_PIN_CFG_DISABLED, .measurement_mode = AGT_MEASURE_DISABLED,
		.agtio_filter = AGT_AGTIO_FILTER_NONE, .enable_pin =
				AGT_ENABLE_PIN_NOT_USED,
		.trigger_edge = AGT_TRIGGER_EDGE_RISING, .counter_bit_width =
				AGT_COUNTER_BIT_WIDTH_32, };
const timer_cfg_t g_agt1_cfg = { .mode = TIMER_MODE_PERIODIC,
/* Actual period: 0.001 seconds. Actual duty: 50%. */.period_counts =
		(uint32_t) 0xea60, .duty_cycle_counts = 0x7530, .source_div =
		(timer_source_div_t) 0, .channel = 1, .p_callback =
		callback_agt_system_manager_cyclic,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
		.p_context = &NULL,
#endif
		.p_extend = &g_agt1_extend, .cycle_end_ipl = (10),
#if defined(VECTOR_NUMBER_AGT1_INT)
    .cycle_end_irq       = VECTOR_NUMBER_AGT1_INT,
#else
		.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_agt1 = { .p_ctrl = &g_agt1_ctrl, .p_cfg = &g_agt1_cfg,
		.p_api = &g_timer_on_agt };
gpt_instance_ctrl_t g_timer_gpt1_ctrl;
#if 1
const gpt_extended_pwm_cfg_t g_timer_gpt1_pwm_extend = { .trough_ipl =
		(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT1_COUNTER_UNDERFLOW)
    .trough_irq          = VECTOR_NUMBER_GPT1_COUNTER_UNDERFLOW,
#else
		.trough_irq = FSP_INVALID_VECTOR,
#endif
		.poeg_link = GPT_POEG_LINK_POEG0, .output_disable =
				(gpt_output_disable_t)(GPT_OUTPUT_DISABLE_NONE), .adc_trigger =
				(gpt_adc_trigger_t)(
						GPT_ADC_TRIGGER_DOWN_COUNT_START_ADC_A
								| GPT_ADC_TRIGGER_NONE),
		.dead_time_count_up = 0, .dead_time_count_down = 0,
		.adc_a_compare_match = 0, .adc_b_compare_match = 0,
		.interrupt_skip_source = GPT_INTERRUPT_SKIP_SOURCE_NONE,
		.interrupt_skip_count = GPT_INTERRUPT_SKIP_COUNT_0,
		.interrupt_skip_adc = GPT_INTERRUPT_SKIP_ADC_NONE,
		.gtioca_disable_setting = GPT_GTIOC_DISABLE_PROHIBITED,
		.gtiocb_disable_setting = GPT_GTIOC_DISABLE_PROHIBITED, };
#endif
const gpt_extended_cfg_t g_timer_gpt1_extend =
		{
				.gtioca = { .output_enabled = false, .stop_level =
						GPT_PIN_LEVEL_LOW }, .gtiocb =
						{ .output_enabled = false, .stop_level =
								GPT_PIN_LEVEL_LOW }, .start_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .stop_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .clear_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .count_up_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .count_down_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .capture_a_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .capture_b_source =
						(gpt_source_t)(GPT_SOURCE_NONE), .capture_a_ipl =
						(BSP_IRQ_DISABLED), .capture_b_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_A)
    .capture_a_irq       = VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_A,
#else
				.capture_a_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_B)
    .capture_b_irq       = VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_B,
#else
				.capture_b_irq = FSP_INVALID_VECTOR,
#endif
				.compare_match_value = { /* CMP_A */0x0, /* CMP_B */0x0 },
				.compare_match_status = (0U << 1U) | 0U,
				.capture_filter_gtioca = GPT_CAPTURE_FILTER_NONE,
				.capture_filter_gtiocb = GPT_CAPTURE_FILTER_NONE,
#if 1
				.p_pwm_cfg = &g_timer_gpt1_pwm_extend,
#else
    .p_pwm_cfg                   = NULL,
#endif
#if 1
				.gtior_setting.gtior_b.gtioa = (1U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.oadflt =
						(uint32_t) GPT_PIN_LEVEL_LOW,
				.gtior_setting.gtior_b.oahld = 0U, .gtior_setting.gtior_b.oae =
						(uint32_t) false, .gtior_setting.gtior_b.oadf =
						(uint32_t) GPT_GTIOC_DISABLE_PROHIBITED,
				.gtior_setting.gtior_b.nfaen =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsa =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
				.gtior_setting.gtior_b.gtiob = (0U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.obdflt =
						(uint32_t) GPT_PIN_LEVEL_LOW,
				.gtior_setting.gtior_b.obhld = 0U, .gtior_setting.gtior_b.obe =
						(uint32_t) false, .gtior_setting.gtior_b.obdf =
						(uint32_t) GPT_GTIOC_DISABLE_PROHIBITED,
				.gtior_setting.gtior_b.nfben =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsb =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
#else
    .gtior_setting.gtior = 0U,
#endif
		};

const timer_cfg_t g_timer_gpt1_cfg =
		{ .mode = TIMER_MODE_TRIANGLE_WAVE_SYMMETRIC_PWM,
				/* Actual period: 0.00003125 seconds. Actual duty: 49.973333333333336%. */.period_counts =
						(uint32_t) 0x753, .duty_cycle_counts = 0x3a9,
				.source_div = (timer_source_div_t) 0, .channel = 1,
				.p_callback = NULL,
				/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
				.p_context = &NULL,
#endif
				.p_extend = &g_timer_gpt1_extend, .cycle_end_ipl =
						(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT1_COUNTER_OVERFLOW)
    .cycle_end_irq       = VECTOR_NUMBER_GPT1_COUNTER_OVERFLOW,
#else
				.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer_gpt1 = { .p_ctrl = &g_timer_gpt1_ctrl, .p_cfg =
		&g_timer_gpt1_cfg, .p_api = &g_timer_on_gpt };
agt_instance_ctrl_t g_agt0_ctrl;
const agt_extended_cfg_t g_agt0_extend = { .count_source = AGT_CLOCK_PCLKB,
		.agto = AGT_PIN_CFG_DISABLED, .agtoab_settings_b.agtoa =
				AGT_PIN_CFG_DISABLED, .agtoab_settings_b.agtob =
				AGT_PIN_CFG_DISABLED, .measurement_mode = AGT_MEASURE_DISABLED,
		.agtio_filter = AGT_AGTIO_FILTER_NONE, .enable_pin =
				AGT_ENABLE_PIN_NOT_USED,
		.trigger_edge = AGT_TRIGGER_EDGE_RISING, .counter_bit_width =
				AGT_COUNTER_BIT_WIDTH_32, };
const timer_cfg_t g_agt0_cfg = { .mode = TIMER_MODE_PERIODIC,
/* Actual period: 0.0005 seconds. Actual duty: 50%. */.period_counts =
		(uint32_t) 0x7530, .duty_cycle_counts = 0x3a98, .source_div =
		(timer_source_div_t) 0, .channel = 0, .p_callback =
		callback_agt_motor_speed_cyclic,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
		.p_context = &NULL,
#endif
		.p_extend = &g_agt0_extend, .cycle_end_ipl = (9),
#if defined(VECTOR_NUMBER_AGT0_INT)
    .cycle_end_irq       = VECTOR_NUMBER_AGT0_INT,
#else
		.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_agt0 = { .p_ctrl = &g_agt0_ctrl, .p_cfg = &g_agt0_cfg,
		.p_api = &g_timer_on_agt };
poeg_instance_ctrl_t g_poeg3_ctrl;
const poeg_cfg_t g_poeg3_cfg = { .trigger = (poeg_trigger_t)(
		POEG_TRIGGER_PIN | POEG_TRIGGER_SOFTWARE), .polarity =
		POEG_GTETRG_POLARITY_ACTIVE_LOW, .noise_filter =
		POEG_GTETRG_NOISE_FILTER_CLK_SOURCE_DIV_32, .channel = 3, .ipl = (0),
		.p_callback = callback_poe_overcurrent, .p_context = NULL,
#if defined(VECTOR_NUMBER_POEG3_EVENT)
    .irq       = VECTOR_NUMBER_POEG3_EVENT,
#else
		.irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const poeg_instance_t g_poeg3 = { .p_ctrl = &g_poeg3_ctrl,
		.p_cfg = &g_poeg3_cfg, .p_api = &g_poeg_on_poeg };
gpt_instance_ctrl_t g_timer_gpt6_ctrl;
#if 1
const gpt_extended_pwm_cfg_t g_timer_gpt6_pwm_extend = { .trough_ipl =
		(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT6_COUNTER_UNDERFLOW)
    .trough_irq          = VECTOR_NUMBER_GPT6_COUNTER_UNDERFLOW,
#else
		.trough_irq = FSP_INVALID_VECTOR,
#endif
		.poeg_link = GPT_POEG_LINK_POEG3, .output_disable =
				(gpt_output_disable_t)(GPT_OUTPUT_DISABLE_NONE), .adc_trigger =
				(gpt_adc_trigger_t)(GPT_ADC_TRIGGER_NONE), .dead_time_count_up =
				240, .dead_time_count_down = 240, .adc_a_compare_match = 0,
		.adc_b_compare_match = 0, .interrupt_skip_source =
				GPT_INTERRUPT_SKIP_SOURCE_NONE, .interrupt_skip_count =
				GPT_INTERRUPT_SKIP_COUNT_0, .interrupt_skip_adc =
				GPT_INTERRUPT_SKIP_ADC_NONE, .gtioca_disable_setting =
				GPT_GTIOC_DISABLE_SET_HI_Z, .gtiocb_disable_setting =
				GPT_GTIOC_DISABLE_SET_HI_Z, };
#endif
const gpt_extended_cfg_t g_timer_gpt6_extend =
		{ .gtioca = { .output_enabled = true, .stop_level = GPT_PIN_LEVEL_LOW },
				.gtiocb = { .output_enabled = true, .stop_level =
						GPT_PIN_LEVEL_HIGH }, .start_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .stop_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .clear_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .count_up_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .count_down_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_a_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_b_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_a_ipl = (BSP_IRQ_DISABLED),
				.capture_b_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT6_CAPTURE_COMPARE_A)
    .capture_a_irq       = VECTOR_NUMBER_GPT6_CAPTURE_COMPARE_A,
#else
				.capture_a_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_GPT6_CAPTURE_COMPARE_B)
    .capture_b_irq       = VECTOR_NUMBER_GPT6_CAPTURE_COMPARE_B,
#else
				.capture_b_irq = FSP_INVALID_VECTOR,
#endif
				.compare_match_value = { /* CMP_A */0x0, /* CMP_B */0x0 },
				.compare_match_status = (0U << 1U) | 0U,
				.capture_filter_gtioca = GPT_CAPTURE_FILTER_NONE,
				.capture_filter_gtiocb = GPT_CAPTURE_FILTER_NONE,
#if 1
				.p_pwm_cfg = &g_timer_gpt6_pwm_extend,
#else
    .p_pwm_cfg                   = NULL,
#endif
#if 1
				.gtior_setting.gtior_b.gtioa = (0U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.oadflt =
						(uint32_t) GPT_PIN_LEVEL_LOW,
				.gtior_setting.gtior_b.oahld = 0U, .gtior_setting.gtior_b.oae =
						(uint32_t) true, .gtior_setting.gtior_b.oadf =
						(uint32_t) GPT_GTIOC_DISABLE_SET_HI_Z,
				.gtior_setting.gtior_b.nfaen =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsa =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
				.gtior_setting.gtior_b.gtiob = (1U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.obdflt =
						(uint32_t) GPT_PIN_LEVEL_HIGH,
				.gtior_setting.gtior_b.obhld = 0U, .gtior_setting.gtior_b.obe =
						(uint32_t) true, .gtior_setting.gtior_b.obdf =
						(uint32_t) GPT_GTIOC_DISABLE_SET_HI_Z,
				.gtior_setting.gtior_b.nfben =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsb =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
#else
    .gtior_setting.gtior = 0U,
#endif
		};

const timer_cfg_t g_timer_gpt6_cfg = { .mode =
		TIMER_MODE_TRIANGLE_WAVE_SYMMETRIC_PWM,
/* Actual period: 0.00025 seconds. Actual duty: 50%. */.period_counts =
		(uint32_t) 0x3a98, .duty_cycle_counts = 0x1d4c, .source_div =
		(timer_source_div_t) 0, .channel = 6, .p_callback = NULL,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
		.p_context = &NULL,
#endif
		.p_extend = &g_timer_gpt6_extend, .cycle_end_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT6_COUNTER_OVERFLOW)
    .cycle_end_irq       = VECTOR_NUMBER_GPT6_COUNTER_OVERFLOW,
#else
		.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer_gpt6 = { .p_ctrl = &g_timer_gpt6_ctrl, .p_cfg =
		&g_timer_gpt6_cfg, .p_api = &g_timer_on_gpt };
gpt_instance_ctrl_t g_timer_gpt5_ctrl;
#if 1
const gpt_extended_pwm_cfg_t g_timer_gpt5_pwm_extend = { .trough_ipl =
		(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT5_COUNTER_UNDERFLOW)
    .trough_irq          = VECTOR_NUMBER_GPT5_COUNTER_UNDERFLOW,
#else
		.trough_irq = FSP_INVALID_VECTOR,
#endif
		.poeg_link = GPT_POEG_LINK_POEG3, .output_disable =
				(gpt_output_disable_t)(GPT_OUTPUT_DISABLE_NONE), .adc_trigger =
				(gpt_adc_trigger_t)(GPT_ADC_TRIGGER_NONE), .dead_time_count_up =
				240, .dead_time_count_down = 240, .adc_a_compare_match = 0,
		.adc_b_compare_match = 0, .interrupt_skip_source =
				GPT_INTERRUPT_SKIP_SOURCE_NONE, .interrupt_skip_count =
				GPT_INTERRUPT_SKIP_COUNT_0, .interrupt_skip_adc =
				GPT_INTERRUPT_SKIP_ADC_NONE, .gtioca_disable_setting =
				GPT_GTIOC_DISABLE_SET_HI_Z, .gtiocb_disable_setting =
				GPT_GTIOC_DISABLE_SET_HI_Z, };
#endif
const gpt_extended_cfg_t g_timer_gpt5_extend =
		{ .gtioca = { .output_enabled = true, .stop_level = GPT_PIN_LEVEL_LOW },
				.gtiocb = { .output_enabled = true, .stop_level =
						GPT_PIN_LEVEL_HIGH }, .start_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .stop_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .clear_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .count_up_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .count_down_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_a_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_b_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_a_ipl = (BSP_IRQ_DISABLED),
				.capture_b_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT5_CAPTURE_COMPARE_A)
    .capture_a_irq       = VECTOR_NUMBER_GPT5_CAPTURE_COMPARE_A,
#else
				.capture_a_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_GPT5_CAPTURE_COMPARE_B)
    .capture_b_irq       = VECTOR_NUMBER_GPT5_CAPTURE_COMPARE_B,
#else
				.capture_b_irq = FSP_INVALID_VECTOR,
#endif
				.compare_match_value = { /* CMP_A */0x0, /* CMP_B */0x0 },
				.compare_match_status = (0U << 1U) | 0U,
				.capture_filter_gtioca = GPT_CAPTURE_FILTER_NONE,
				.capture_filter_gtiocb = GPT_CAPTURE_FILTER_NONE,
#if 1
				.p_pwm_cfg = &g_timer_gpt5_pwm_extend,
#else
    .p_pwm_cfg                   = NULL,
#endif
#if 1
				.gtior_setting.gtior_b.gtioa = (0U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.oadflt =
						(uint32_t) GPT_PIN_LEVEL_LOW,
				.gtior_setting.gtior_b.oahld = 0U, .gtior_setting.gtior_b.oae =
						(uint32_t) true, .gtior_setting.gtior_b.oadf =
						(uint32_t) GPT_GTIOC_DISABLE_SET_HI_Z,
				.gtior_setting.gtior_b.nfaen =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsa =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
				.gtior_setting.gtior_b.gtiob = (1U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.obdflt =
						(uint32_t) GPT_PIN_LEVEL_HIGH,
				.gtior_setting.gtior_b.obhld = 0U, .gtior_setting.gtior_b.obe =
						(uint32_t) true, .gtior_setting.gtior_b.obdf =
						(uint32_t) GPT_GTIOC_DISABLE_SET_HI_Z,
				.gtior_setting.gtior_b.nfben =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsb =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
#else
    .gtior_setting.gtior = 0U,
#endif
		};

const timer_cfg_t g_timer_gpt5_cfg = { .mode =
		TIMER_MODE_TRIANGLE_WAVE_SYMMETRIC_PWM,
/* Actual period: 0.00025 seconds. Actual duty: 50%. */.period_counts =
		(uint32_t) 0x3a98, .duty_cycle_counts = 0x1d4c, .source_div =
		(timer_source_div_t) 0, .channel = 5, .p_callback = NULL,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
		.p_context = &NULL,
#endif
		.p_extend = &g_timer_gpt5_extend, .cycle_end_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT5_COUNTER_OVERFLOW)
    .cycle_end_irq       = VECTOR_NUMBER_GPT5_COUNTER_OVERFLOW,
#else
		.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer_gpt5 = { .p_ctrl = &g_timer_gpt5_ctrl, .p_cfg =
		&g_timer_gpt5_cfg, .p_api = &g_timer_on_gpt };
gpt_instance_ctrl_t g_timer_gpt4_ctrl;
#if 1
const gpt_extended_pwm_cfg_t g_timer_gpt4_pwm_extend = { .trough_ipl =
		(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT4_COUNTER_UNDERFLOW)
    .trough_irq          = VECTOR_NUMBER_GPT4_COUNTER_UNDERFLOW,
#else
		.trough_irq = FSP_INVALID_VECTOR,
#endif
		.poeg_link = GPT_POEG_LINK_POEG3, .output_disable =
				(gpt_output_disable_t)(GPT_OUTPUT_DISABLE_NONE), .adc_trigger =
				(gpt_adc_trigger_t)(
						GPT_ADC_TRIGGER_DOWN_COUNT_START_ADC_A
								| GPT_ADC_TRIGGER_NONE), .dead_time_count_up =
				240, .dead_time_count_down = 240, .adc_a_compare_match = 0,
		.adc_b_compare_match = 0, .interrupt_skip_source =
				GPT_INTERRUPT_SKIP_SOURCE_NONE, .interrupt_skip_count =
				GPT_INTERRUPT_SKIP_COUNT_0, .interrupt_skip_adc =
				GPT_INTERRUPT_SKIP_ADC_NONE, .gtioca_disable_setting =
				GPT_GTIOC_DISABLE_SET_HI_Z, .gtiocb_disable_setting =
				GPT_GTIOC_DISABLE_SET_HI_Z, };
#endif
const gpt_extended_cfg_t g_timer_gpt4_extend =
		{ .gtioca = { .output_enabled = true, .stop_level = GPT_PIN_LEVEL_LOW },
				.gtiocb = { .output_enabled = true, .stop_level =
						GPT_PIN_LEVEL_HIGH }, .start_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .stop_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .clear_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .count_up_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .count_down_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_a_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_b_source = (gpt_source_t)(
						GPT_SOURCE_NONE), .capture_a_ipl = (BSP_IRQ_DISABLED),
				.capture_b_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT4_CAPTURE_COMPARE_A)
    .capture_a_irq       = VECTOR_NUMBER_GPT4_CAPTURE_COMPARE_A,
#else
				.capture_a_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_GPT4_CAPTURE_COMPARE_B)
    .capture_b_irq       = VECTOR_NUMBER_GPT4_CAPTURE_COMPARE_B,
#else
				.capture_b_irq = FSP_INVALID_VECTOR,
#endif
				.compare_match_value = { /* CMP_A */0x0, /* CMP_B */0x0 },
				.compare_match_status = (0U << 1U) | 0U,
				.capture_filter_gtioca = GPT_CAPTURE_FILTER_NONE,
				.capture_filter_gtiocb = GPT_CAPTURE_FILTER_NONE,
#if 1
				.p_pwm_cfg = &g_timer_gpt4_pwm_extend,
#else
    .p_pwm_cfg                   = NULL,
#endif
#if 1
				.gtior_setting.gtior_b.gtioa = (0U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.oadflt =
						(uint32_t) GPT_PIN_LEVEL_LOW,
				.gtior_setting.gtior_b.oahld = 0U, .gtior_setting.gtior_b.oae =
						(uint32_t) true, .gtior_setting.gtior_b.oadf =
						(uint32_t) GPT_GTIOC_DISABLE_SET_HI_Z,
				.gtior_setting.gtior_b.nfaen =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsa =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
				.gtior_setting.gtior_b.gtiob = (1U << 4U) | (0U << 2U)
						| (3U << 0U), .gtior_setting.gtior_b.obdflt =
						(uint32_t) GPT_PIN_LEVEL_HIGH,
				.gtior_setting.gtior_b.obhld = 0U, .gtior_setting.gtior_b.obe =
						(uint32_t) true, .gtior_setting.gtior_b.obdf =
						(uint32_t) GPT_GTIOC_DISABLE_SET_HI_Z,
				.gtior_setting.gtior_b.nfben =
						((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
				.gtior_setting.gtior_b.nfcsb =
						((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
#else
    .gtior_setting.gtior = 0U,
#endif
		};

const timer_cfg_t g_timer_gpt4_cfg = { .mode =
		TIMER_MODE_TRIANGLE_WAVE_SYMMETRIC_PWM,
/* Actual period: 0.00025 seconds. Actual duty: 50%. */.period_counts =
		(uint32_t) 0x3a98, .duty_cycle_counts = 0x1d4c, .source_div =
		(timer_source_div_t) 0, .channel = 4, .p_callback = NULL,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
		.p_context = &NULL,
#endif
		.p_extend = &g_timer_gpt4_extend, .cycle_end_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT4_COUNTER_OVERFLOW)
    .cycle_end_irq       = VECTOR_NUMBER_GPT4_COUNTER_OVERFLOW,
#else
		.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer_gpt4 = { .p_ctrl = &g_timer_gpt4_ctrl, .p_cfg =
		&g_timer_gpt4_cfg, .p_api = &g_timer_on_gpt };
gpt_three_phase_instance_ctrl_t g_three_phase0_ctrl;
const three_phase_cfg_t g_three_phase0_cfg = { .buffer_mode =
		(THREE_PHASE_BUFFER_MODE_SINGLE), .p_timer_instance = { &g_timer_gpt4,
		&g_timer_gpt5, &g_timer_gpt6 }, .callback_ch = THREE_PHASE_CHANNEL_U,
		.channel_mask = (1 << 4) | (1 << 5) | (1 << 6), .p_context = NULL,
		.p_extend = NULL, };
/* Instance structure to use this module. */
const three_phase_instance_t g_three_phase0 = { .p_ctrl = &g_three_phase0_ctrl,
		.p_cfg = &g_three_phase0_cfg, .p_api =
				&g_gpt_three_phase_on_gpt_three_phase };
#define RA_NOT_DEFINED (0) // TODO: Remove this after implementing all channels and groups.

#if (1) // Define Virtual Channel 0 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_0_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_0,

		.channel_cfg_bits.group = (1), .channel_cfg_bits.channel =
				(ADC_CHANNEL_0), .channel_cfg_bits.self_diag_enabled =
				((ADC_CHANNEL_0) == ADC_CHANNEL_SELF_DIAGNOSIS),
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

