NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/ra_gen/hal_data.c
				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_0)
						!= ADC_CHANNEL_SELF_DIAGNOSIS), };
#endif

#if (1) // Define Virtual Channel 1 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_1_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_1,

		.channel_cfg_bits.group = (1), .channel_cfg_bits.channel =
				(ADC_CHANNEL_2), .channel_cfg_bits.self_diag_enabled =
				((ADC_CHANNEL_2) == ADC_CHANNEL_SELF_DIAGNOSIS),
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_2)
						!= ADC_CHANNEL_SELF_DIAGNOSIS), };
#endif

#if (1) // Define Virtual Channel 2 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_2_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_2,

		.channel_cfg_bits.group = (1), .channel_cfg_bits.channel =
				(ADC_CHANNEL_4), .channel_cfg_bits.self_diag_enabled =
				((ADC_CHANNEL_4) == ADC_CHANNEL_SELF_DIAGNOSIS),
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_4)
						!= ADC_CHANNEL_SELF_DIAGNOSIS), };
#endif

#if (2) // Define Virtual Channel 3 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_3_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_3,

		.channel_cfg_bits.group = (2), .channel_cfg_bits.channel =
				(ADC_CHANNEL_27), .channel_cfg_bits.self_diag_enabled =
				((ADC_CHANNEL_27) == ADC_CHANNEL_SELF_DIAGNOSIS),
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_2,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_27)
						!= ADC_CHANNEL_SELF_DIAGNOSIS), };
#endif

#if (2) // Define Virtual Channel 4 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_4_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_4,

		.channel_cfg_bits.group = (2), .channel_cfg_bits.channel =
				(ADC_CHANNEL_28), .channel_cfg_bits.self_diag_enabled =
				((ADC_CHANNEL_28) == ADC_CHANNEL_SELF_DIAGNOSIS),
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_2,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_28)
						!= ADC_CHANNEL_SELF_DIAGNOSIS), };
#endif

#if (2) // Define Virtual Channel 5 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_5_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_5,

		.channel_cfg_bits.group = (2), .channel_cfg_bits.channel =
				(ADC_CHANNEL_6), .channel_cfg_bits.self_diag_enabled =
				((ADC_CHANNEL_6) == ADC_CHANNEL_SELF_DIAGNOSIS),
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_1,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_6)
						!= ADC_CHANNEL_SELF_DIAGNOSIS), };
#endif

