NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/ra_gen/hal_data.c
                         .self_diagnosis_mask             = (ADC_B_SELF_DIAGNOSIS_DISABLED << R_ADC_B0_ADSGDCR0_DIAGVAL_Pos),

                         .limit_clip_interrupt_enable     = (1),
                         .virtual_channel_count           = 0 + (
                         ((1) == 8)+((1) == 8)+((1) == 8)+((2) == 8)+((2) == 8)+((2) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)+((0) == 8)),
#if (((1) == 8)||((1) == 8)||((1) == 8)||((2) == 8)||((2) == 8)||((2) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8)||((0) == 8))

                         .p_virtual_channels = (adc_b_virtual_channel_cfg_t**)g_adc0_group_7_virtual_channels,
                         #else
                         .p_virtual_channels = NULL,
                         #endif
                     };
                     #endif

#if (0) // Define Scan Group 8 if it's enabled
                     const adc_b_group_cfg_t g_adc0_group_8_cfg =
                     {
                         .scan_group_id                   = ADC_GROUP_ID_8,
                         .converter_selection             = (0),
                         .scan_group_enable               = (0),
                         .scan_end_interrupt_enable       = (1),
                         .external_trigger_enable_mask    = ( ADC_B_EXTERNAL_TRIGGER_NONE),
                         .elc_trigger_enable_mask         = ( 0x00),
                         .gpt_trigger_enable_mask         = ( ADC_B_GPT_TRIGGER_NONE),

                         .self_diagnosis_mask             = (ADC_B_SELF_DIAGNOSIS_DISABLED << R_ADC_B0_ADSGDCR0_DIAGVAL_Pos),

                         .limit_clip_interrupt_enable     = (1),
                         .virtual_channel_count           = 0 + (
                         ((1) == 9)+((1) == 9)+((1) == 9)+((2) == 9)+((2) == 9)+((2) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)+((0) == 9)),
#if (((1) == 9)||((1) == 9)||((1) == 9)||((2) == 9)||((2) == 9)||((2) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9))

                         .p_virtual_channels = (adc_b_virtual_channel_cfg_t**)g_adc0_group_8_virtual_channels,
                         #else
                         .p_virtual_channels = NULL,
                         #endif
                     };
                     #endif
#if ((1)||(1)||(0)||(0)||(0)||(0)||(0)||(0)||(0))
const adc_b_group_cfg_t *const g_adc0_scan_cfg_groups[] = {
#if (0 != (1))
		&g_adc0_group_0_cfg,
#endif

#if (0 != (1))
		&g_adc0_group_1_cfg,
#endif

#if (0 != (0))
                           &g_adc0_group_2_cfg,
                           #endif

#if (0 != (0))
                           &g_adc0_group_3_cfg,
                           #endif

#if (0 != (0))
                           &g_adc0_group_4_cfg,
                           #endif

#if (0 != (0))
                           &g_adc0_group_5_cfg,
                           #endif

#if (0 != (0))
                           &g_adc0_group_6_cfg,
                           #endif

#if (0 != (0))
                           &g_adc0_group_7_cfg,
                           #endif

#if (0 != (0))
                           &g_adc0_group_8_cfg,
                           #endif
		};
#endif

const adc_b_scan_cfg_t g_adc0_scan_cfg = { .group_count = (0 + (0 != (1))
		+ (0 != (1)) + (0 != (0)) + (0 != (0)) + (0 != (0)) + (0 != (0))
		+ (0 != (0)) + (0 != (0)) + (0 != (0))),
#if ((0 != (1))||(0 != (1))||(0 != (0))||(0 != (0))||(0 != (0))||(0 != (0))||(0 != (0))||(0 != (0))||(0 != (0)))
		.p_adc_groups = (adc_b_group_cfg_t**) g_adc0_scan_cfg_groups,
#else
                       .p_adc_groups = NULL,
                       #endif
		};

const adc_b_isr_cfg_t g_adc0_isr_cfg = { .calibration_end_ipl_adc_0 = (12),
		.calibration_end_ipl_adc_1 = (12), .limit_clip_ipl = (BSP_IRQ_DISABLED),
		.conversion_error_ipl_adc_0 = (BSP_IRQ_DISABLED),
		.conversion_error_ipl_adc_1 = (BSP_IRQ_DISABLED),
		.overflow_error_ipl_adc_0 = (BSP_IRQ_DISABLED),
		.overflow_error_ipl_adc_1 = (BSP_IRQ_DISABLED),

		.scan_end_ipl_group_0 = (5), .scan_end_ipl_group_1 = (3),
		.scan_end_ipl_group_2 = (BSP_IRQ_DISABLED), .scan_end_ipl_group_3 =
				(BSP_IRQ_DISABLED), .scan_end_ipl_group_4 = (BSP_IRQ_DISABLED),
		.scan_end_ipl_group_5678 = (BSP_IRQ_DISABLED), .fifo_overflow_ipl =
				(BSP_IRQ_DISABLED), .fifo_read_ipl_group_0 = (BSP_IRQ_DISABLED),
		.fifo_read_ipl_group_1 = (BSP_IRQ_DISABLED), .fifo_read_ipl_group_2 =
				(BSP_IRQ_DISABLED), .fifo_read_ipl_group_3 = (BSP_IRQ_DISABLED),
		.fifo_read_ipl_group_4 = (BSP_IRQ_DISABLED), .fifo_read_ipl_group_5678 =
				(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_ADC12_CALEND0) && ( (12) != BSP_IRQ_DISABLED )
    .calibration_end_irq_adc_0 = VECTOR_NUMBER_ADC12_CALEND0,
#else
		.calibration_end_irq_adc_0 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_CALEND1) && ( (12) != BSP_IRQ_DISABLED )
    .calibration_end_irq_adc_1 = VECTOR_NUMBER_ADC12_CALEND1,
#else
		.calibration_end_irq_adc_1 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_LIMCLPI) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .limit_clip_irq = VECTOR_NUMBER_ADC12_LIMCLPI,
#else
		.limit_clip_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ERR0) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .conversion_error_irq_adc_0 = VECTOR_NUMBER_ADC12_ERR0,
#else
		.conversion_error_irq_adc_0 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ERR1) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .conversion_error_irq_adc_1 = VECTOR_NUMBER_ADC12_ERR1,
#else
		.conversion_error_irq_adc_1 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_RESOVF0) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .overflow_error_irq_adc_0 = VECTOR_NUMBER_ADC12_RESOVF0,
#else
		.overflow_error_irq_adc_0 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_RESOVF1) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .overflow_error_irq_adc_1 = VECTOR_NUMBER_ADC12_RESOVF1,
#else
		.overflow_error_irq_adc_1 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ADI0) && ( (5) != BSP_IRQ_DISABLED )
    .scan_end_irq_group_0 = VECTOR_NUMBER_ADC12_ADI0,
#else
		.scan_end_irq_group_0 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ADI1) && ( (3) != BSP_IRQ_DISABLED )
    .scan_end_irq_group_1 = VECTOR_NUMBER_ADC12_ADI1,
#else
		.scan_end_irq_group_1 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ADI2) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .scan_end_irq_group_2 = VECTOR_NUMBER_ADC12_ADI2,
#else
		.scan_end_irq_group_2 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ADI3) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .scan_end_irq_group_3 = VECTOR_NUMBER_ADC12_ADI3,
#else
		.scan_end_irq_group_3 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ADI4) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .scan_end_irq_group_4 = VECTOR_NUMBER_ADC12_ADI4,
#else
		.scan_end_irq_group_4 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_ADI5678) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .scan_end_irq_group_5678 = VECTOR_NUMBER_ADC12_ADI5678,
#else
		.scan_end_irq_group_5678 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOOVF) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_overflow_irq = VECTOR_NUMBER_ADC12_FIFOOVF,
#else
		.fifo_overflow_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOREQ0) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_read_irq_group_0 = VECTOR_NUMBER_ADC12_FIFOREQ0,
#else
		.fifo_read_irq_group_0 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOREQ1) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_read_irq_group_1 = VECTOR_NUMBER_ADC12_FIFOREQ1,
#else
		.fifo_read_irq_group_1 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOREQ2) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_read_irq_group_2 = VECTOR_NUMBER_ADC12_FIFOREQ2,
#else
		.fifo_read_irq_group_2 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOREQ3) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_read_irq_group_3 = VECTOR_NUMBER_ADC12_FIFOREQ3,
#else
		.fifo_read_irq_group_3 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOREQ4) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_read_irq_group_4 = VECTOR_NUMBER_ADC12_FIFOREQ4,
#else
		.fifo_read_irq_group_4 = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_ADC12_FIFOREQ5678) && ( (BSP_IRQ_DISABLED) != BSP_IRQ_DISABLED )
    .fifo_read_irq_group_5678 = VECTOR_NUMBER_ADC12_FIFOREQ5678,
#else
		.fifo_read_irq_group_5678 = FSP_INVALID_VECTOR,
#endif
		};

const adc_b_extended_cfg_t g_adc0_cfg_extend = { .clock_control_data =
		((ADC_B_CLOCK_SOURCE_PCLKC << R_ADC_B0_ADCLKCR_CLKSEL_Pos)
				| (ADC_B_CLOCK_DIV_1 << R_ADC_B0_ADCLKCR_DIVR_Pos)),
		.sync_operation_control = (((1) << R_ADC_B0_ADSYCR_ADSYDIS0_Pos)
				| ((1) << R_ADC_B0_ADSYCR_ADSYDIS1_Pos)
				| (100 << R_ADC_B0_ADSYCR_ADSYCYC_Pos)), .adc_b_converter_mode[0
				] = { .mode = (ADC_B_CONVERTER_MODE_SINGLE_SCAN), .method =
						(ADC_B_CONVERSION_METHOD_SAR) }, .adc_b_converter_mode[1
				] = { .mode = (ADC_B_CONVERTER_MODE_SINGLE_SCAN), .method =
						(ADC_B_CONVERSION_METHOD_SAR) },
		.converter_selection_0 = (((0) << R_ADC_B0_ADSGCR0_SGADS0_Pos)
				| ((1) << R_ADC_B0_ADSGCR0_SGADS1_Pos)
				| ((0) << R_ADC_B0_ADSGCR0_SGADS2_Pos)
				| ((0) << R_ADC_B0_ADSGCR0_SGADS3_Pos)),
		.converter_selection_1 = (((0) << R_ADC_B0_ADSGCR1_SGADS4_Pos)
				| ((0) << R_ADC_B0_ADSGCR1_SGADS5_Pos)
				| ((0) << R_ADC_B0_ADSGCR1_SGADS6_Pos)
				| ((0) << R_ADC_B0_ADSGCR1_SGADS7_Pos)),
		.converter_selection_2 = ((0) << R_ADC_B0_ADSGCR2_SGADS8_Pos),

		.fifo_enable_mask = (((0) << R_ADC_B0_ADFIFOCR_FIFOEN0_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN1_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN2_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN3_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN4_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN5_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN6_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN7_Pos)
				| ((0) << R_ADC_B0_ADFIFOCR_FIFOEN8_Pos)),
		.fifo_interrupt_enable_mask = (((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE0_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE1_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE2_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE3_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE4_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE5_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE6_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE7_Pos)
				| ((0) << R_ADC_B0_ADFIFOINTCR_FIFOIE8_Pos)),
		.fifo_interrupt_level0 = ((0 << R_ADC_B0_ADFIFOINTLR0_FIFOILV0_Pos)
				| (0 << R_ADC_B0_ADFIFOINTLR0_FIFOILV1_Pos)),
		.fifo_interrupt_level1 = ((0 << R_ADC_B0_ADFIFOINTLR1_FIFOILV2_Pos)
				| (0 << R_ADC_B0_ADFIFOINTLR1_FIFOILV3_Pos)),
		.fifo_interrupt_level2 = ((0 << R_ADC_B0_ADFIFOINTLR2_FIFOILV4_Pos)
				| (0 << R_ADC_B0_ADFIFOINTLR2_FIFOILV5_Pos)),
		.fifo_interrupt_level3 = ((0 << R_ADC_B0_ADFIFOINTLR3_FIFOILV6_Pos)
				| (0 << R_ADC_B0_ADFIFOINTLR3_FIFOILV7_Pos)),
		.fifo_interrupt_level4 = (0 << R_ADC_B0_ADFIFOINTLR4_FIFOILV8_Pos),

		.start_trigger_delay_0 = ((0 << R_ADC_B0_ADTRGDLR0_TRGDLY0_Pos)
				| (0 << R_ADC_B0_ADTRGDLR0_TRGDLY1_Pos)),
		.start_trigger_delay_1 = ((0 << R_ADC_B0_ADTRGDLR1_TRGDLY2_Pos)
				| (0 << R_ADC_B0_ADTRGDLR1_TRGDLY3_Pos)),
		.start_trigger_delay_2 = ((0 << R_ADC_B0_ADTRGDLR2_TRGDLY4_Pos)
				| (0 << R_ADC_B0_ADTRGDLR2_TRGDLY5_Pos)),
		.start_trigger_delay_3 = ((0 << R_ADC_B0_ADTRGDLR3_TRGDLY6_Pos)
				| (0 << R_ADC_B0_ADTRGDLR3_TRGDLY7_Pos)),
		.start_trigger_delay_4 = ((0 << R_ADC_B0_ADTRGDLR4_TRGDLY8_Pos)),
		.calibration_adc_state = ((10 << R_ADC_B0_ADCALSTCR_CALADSST_Pos)
				| (6 << R_ADC_B0_ADCALSTCR_CALADCST_Pos)),
		.calibration_sample_and_hold = ((25 << R_ADC_B0_ADCALSHCR_CALSHSST_Pos)
				| (3 << R_ADC_B0_ADCALSHCR_CALSHHST_Pos)), .p_isr_cfg =
				&g_adc0_isr_cfg, .sampling_state_tables = {
				((10 << R_ADC_B0_ADSSTR0_SST0_Pos)
						| (4 << R_ADC_B0_ADSSTR0_SST1_Pos)), ((24
						<< R_ADC_B0_ADSSTR1_SST2_Pos)
						| (95 << R_ADC_B0_ADSSTR1_SST3_Pos)), ((95
						<< R_ADC_B0_ADSSTR2_SST4_Pos)
						| (95 << R_ADC_B0_ADSSTR2_SST5_Pos)), ((95
						<< R_ADC_B0_ADSSTR3_SST6_Pos)
						| (95 << R_ADC_B0_ADSSTR3_SST7_Pos)), ((95
						<< R_ADC_B0_ADSSTR4_SST8_Pos)
						| (95 << R_ADC_B0_ADSSTR4_SST9_Pos)), ((95
						<< R_ADC_B0_ADSSTR5_SST10_Pos)
						| (95 << R_ADC_B0_ADSSTR5_SST11_Pos)), ((95
						<< R_ADC_B0_ADSSTR6_SST12_Pos)
						| (95 << R_ADC_B0_ADSSTR6_SST13_Pos)), ((95
						<< R_ADC_B0_ADSSTR7_SST14_Pos)
						| (95 << R_ADC_B0_ADSSTR7_SST15_Pos)), },
		.sample_and_hold_enable_mask = (ADC_B_SAMPLE_AND_HOLD_MASK_UNIT_0
				| ADC_B_SAMPLE_AND_HOLD_MASK_UNIT_1
				| ADC_B_SAMPLE_AND_HOLD_MASK_UNIT_2
				| ADC_B_SAMPLE_AND_HOLD_MASK_NONE),
		.sample_and_hold_config_012 = ((120 << R_ADC_B0_ADSHSTR1_SHSST_Pos)
				| (3 << R_ADC_B0_ADSHSTR0_SHHST_Pos)),
		.sample_and_hold_config_456 = ((95 << R_ADC_B0_ADSHSTR1_SHSST_Pos)
				| (5 << R_ADC_B0_ADSHSTR1_SHHST_Pos)), .conversion_state = ((6
				<< R_ADC_B0_ADCNVSTR_CST0_Pos)
				| (6 << R_ADC_B0_ADCNVSTR_CST1_Pos)), .user_offset_tables = { 0,
				0, 0, 0, 0, 0, 0, 0, }, .user_gain_tables = { 0, 0, 0, 0, 0, 0,
				0, 0, }, .limiter_clip_interrupt_enable_mask = (0x00),
		.limiter_clip_tables = { (0 | 0 << R_ADC_B0_ADLIMTR0_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR1_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR2_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR3_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR4_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR5_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR6_LIMU_Pos), (0
				| 0 << R_ADC_B0_ADLIMTR7_LIMU_Pos), },

#if (1 == 0)
    .pga_gain[0] = ADC_B_PGA_GAIN_SINGLE_ENDED_2_500,
    #elif (2 == 0)
    .pga_gain[0] = ADC_B_PGA_GAIN_DIFFERENTIAL_1_500,
    #else
		.pga_gain[0] = ADC_B_PGA_GAIN_DISABLED,
#endif

#if (1 == 0)
    .pga_gain[1] = ADC_B_PGA_GAIN_SINGLE_ENDED_2_500,
    #elif (2 == 0)
    .pga_gain[1] = ADC_B_PGA_GAIN_DIFFERENTIAL_1_500,
    #else
		.pga_gain[1] = ADC_B_PGA_GAIN_DISABLED,
#endif

#if (1 == 0)
    .pga_gain[2] = ADC_B_PGA_GAIN_SINGLE_ENDED_2_500,
    #elif (2 == 0)
    .pga_gain[2] = ADC_B_PGA_GAIN_DIFFERENTIAL_1_500,
    #else
		.pga_gain[2] = ADC_B_PGA_GAIN_DISABLED,
#endif

#if (1 == 0)
    .pga_gain[3] = ADC_B_PGA_GAIN_SINGLE_ENDED_2_500,
    #elif (2 == 0)
    .pga_gain[3] = ADC_B_PGA_GAIN_DIFFERENTIAL_1_500,
    #else
		.pga_gain[3] = ADC_B_PGA_GAIN_DISABLED,
#endif

		/* For debug only! Prolonged use of PGA Monitor function may deteriorate PGA characteristics. See user manual for more information.*/
		.pga_debug_monitor_mask_b.unit_0 = 0, .pga_debug_monitor_mask_b.unit_1 =
				0, .pga_debug_monitor_mask_b.unit_2 = 0,
		.pga_debug_monitor_mask_b.unit_3 = 0, .adc_filter_selection[0].bits =
				((R_ADC_B0_ADDFSR0_DFSEL0_Msk
						& (ADC_B_DIGITAL_FILTER_MODE_SINC3
								<< R_ADC_B0_ADDFSR0_DFSEL0_Pos))
						| (R_ADC_B0_ADDFSR0_DFSEL1_Msk
								& (ADC_B_DIGITAL_FILTER_MODE_SINC3
										<< R_ADC_B0_ADDFSR0_DFSEL1_Pos))
						| (R_ADC_B0_ADDFSR0_DFSEL2_Msk
								& (ADC_B_DIGITAL_FILTER_MODE_SINC3
										<< R_ADC_B0_ADDFSR0_DFSEL2_Pos))
						| (R_ADC_B0_ADDFSR0_DFSEL3_Msk
								& (ADC_B_DIGITAL_FILTER_MODE_SINC3
										<< R_ADC_B0_ADDFSR0_DFSEL3_Pos))),
		.adc_filter_selection[1].bits = ((R_ADC_B0_ADDFSR1_DFSEL0_Msk
				& (ADC_B_DIGITAL_FILTER_MODE_SINC3
						<< R_ADC_B0_ADDFSR1_DFSEL0_Pos))
				| (R_ADC_B0_ADDFSR1_DFSEL1_Msk
						& (ADC_B_DIGITAL_FILTER_MODE_SINC3
								<< R_ADC_B0_ADDFSR1_DFSEL1_Pos))
				| (R_ADC_B0_ADDFSR1_DFSEL2_Msk
						& (ADC_B_DIGITAL_FILTER_MODE_SINC3
								<< R_ADC_B0_ADDFSR1_DFSEL2_Pos))
				| (R_ADC_B0_ADDFSR1_DFSEL3_Msk
						& (ADC_B_DIGITAL_FILTER_MODE_SINC3
								<< R_ADC_B0_ADDFSR1_DFSEL3_Pos))), };

const adc_cfg_t g_adc0_cfg =
		{ .unit = 0xFFFC,
				.mode = (adc_mode_t) 0, // Unused
				.resolution = (adc_resolution_t) 0, // Unused
				.alignment = ADC_ALIGNMENT_RIGHT,
				.trigger = (adc_trigger_t) 0, // Unused
				.p_callback = callback_gpt_adc_cyclic,
#if defined(NULL)
    .p_context           = NULL,
#else
				.p_context = &NULL,
#endif
				.p_extend = &g_adc0_cfg_extend,

				.scan_end_irq = FSP_INVALID_VECTOR, .scan_end_ipl =
						BSP_IRQ_DISABLED, .scan_end_b_irq = FSP_INVALID_VECTOR,
				.scan_end_b_ipl = BSP_IRQ_DISABLED, };

adc_b_instance_ctrl_t g_adc0_ctrl;

const adc_instance_t g_adc0 = { .p_ctrl = &g_adc0_ctrl, .p_cfg = &g_adc0_cfg,
		.p_channel_cfg = &g_adc0_scan_cfg, .p_api = &g_adc_on_adc_b, };

#undef RA_NOT_DEFINED
void g_hal_init(void) {
	g_common_init();
}
